{"data": "---\ntitle: Installing the Docker client on Windows Subsystem for Linux (Ubuntu)\ndate: 2017-09-25 20:09:25\ntags:\n- Docker\n- 部署\n- VPS\n- Ubutun\n- WSL\n- Window 10\n---\n{% asset_img '1.png' %}\nI'm a PC guy, I have always been. I played around a little bit with Linux back in the university days, but that was it.\n\nBut now, Windows brought Linux a little closer. I don't have to do anything complicated like dual booting or having another computer set up just to experience the Linux (non GUI) environment.\n\nAs a Windows Insider, I tried the Windows Subsystem for Linux since day 1 and I really enjoyed it.\n\nNow that Falls Creators Update is out, I'm using the Ubuntu distro from the store, and the first thing I want to do is having the Docker client installed.. It is not rocket science, but I did have some bumps on the road (because of my pretty low knowledge of Linux), so I thought I'd write what I've done to achieve that, in case it could be useful to somebody else.\n\nThere's something you need to understand first. The Docker Engine does not run on WSL, you HAVE to have Docker For Windows installed on your host machine. What we'll end up with at the end of this document is the Docker client running on Linux (WSL) sending commands to your Docker Engine daemon installed on Windows.\n\nSo, open you Ubuntu bash console, the first thing is to install the client. In order to do that you have to use apt-get, which is Ubuntu's package manager (more info about apt here).\n\nUpdate the apt package index:\n$ sudo apt-get update\n\n## 2. Install packages to allow apt to use a repository over HTTPS:\n\n  $ sudo apt-get install \\\n  apt-transport-https \\\n  ca-certificates \\\n  curl \\\n  software-properties-common\n\n\n## 3. Add Docker’s official GPG key:\n\n  $ curl -fsSL https://download.docker.com/linux/ubuntu/gpg | sudo apt-key add -\n\nVerify that you now have the key with the fingerprint 9DC8 5822 9FC7 DD38 854A E2D8 8D81 803C 0EBF CD88, by searching for the last 8 characters of the fingerprint.\n\n  $ sudo apt-key fingerprint 0EBFCD88\n\npub 4096R/0EBFCD88 2017–02–22\n Key fingerprint = 9DC8 5822 9FC7 DD38 854A E2D8 8D81 803C 0EBF CD88\nuid Docker Release (CE deb) <docker@docker.com>\nsub 4096R/F273FCD8 2017–02–22\n\n## 4. Use the following command to set up the stable repository. You always need the stable repository, even if you want to install builds from the edge or test repositories as well. To add the edge or test repository, add the word edge or test (or both) after the word stable in the commands below.\n\n  $ sudo add-apt-repository \\\n  “deb [arch=amd64] https://download.docker.com/linux/ubuntu \\\n  $(lsb_release -cs) \\\n  stable”\n\nNow we're ready to install Docker Community Edition\n\n## 5. Update the apt package index again\n\n  $ sudo apt-get update\n\n## 6. And install Docker CE\n\n  $ sudo apt-get install docker-ce\n\nWhen that finishes, you'll end up having everything installed in Linux, but as I mentioned before, the Docker Engine does not run in WSL so if you write any command like docker images, you'll see a message like this one:\n\nCannot connect to the Docker daemon at unix:///var/run/docker.sock. Is the docker daemon running?\nNo, it is not running and it'll never be, at least for now.\n\nYou need to tell the Docker client where the Docker host is, and you can do that by using the -H option as follows:\n\n  $ docker -H localhost:2375 images\n\nIf you don't want to type the host every time, you can set up and environment variable called DOCKER_HOST to localhost:2375\n\n  $ export DOCKER_HOST=localhost:2375\n\nNow just running docker images will show the images in your host environment.\n\nBut, that environment variable will last only as long as the session does. You would have to set it every time you open bash. So, in order to avoid that, you set that variable in a file called .bash_profile in your home directory, like this:\n\n  $ echo “export DOCKER_HOST=localhost:2375” >> ~/.bash_profile\n\nRestart the bash console and the DOCKER_HOST variable should be there, just type docker images to check everything is there.\n\nI hope this post will help other, if it does, let me know.\n\nEDIT: Make sure you expose the daemon on Windows, otherwise it won't work.\n{% asset_img '2.png' %}\n\n\nReferences: Get Docker CE for Ubuntu\n\nSpecial thanks to Rich Turner for his kindness and patience.\n\nEDIT: I recently learned there's an official, more complicated but secure, way of achieving the same, so I thought I'd share it here: WSL Interoperability with Docker\n\n"}