{"data": "---\ntitle: docker初探\ndate: 2017-09-12 21:38:27\ntags:\n- docker\n- Linux\n- 虚拟机\n- 搭建\n- VPS\n- 管理\n\n---\n## Docker CE 还是 Docker EE\n\n\nDocker在2016年很早的时候就明确了将会在企业级方面重点跟进。而在短短的一年时间之内推出的1.12和1.13的版本在功能上确实是很大的进步。而在2017年的3月1号之后，Docker的版本命名开始发生变化，同时将CE版本和EE版本进行分开，而这些也是突然发现docker1.13的安装脚本不好用了才发现的，一起简单来看一下具体情况吧。\n\n## 平台支持\n\n目前docker的CE和EE所支持的平台情况如下所示，大家所钟情的Ubuntu和CentOS作为Linux发行版所支持的CE和EE均支持的。 \n{% asset_img '1.JPG' %}\n\n## Get Started, Part 1: Orientation and setup\n\n\nWelcome! We are excited that you want to learn Docker. The _Docker Get Started Tutorial_\nteaches you how to:\n\n1.  Set up your Docker environment (on this page)\n2.  [Build an image and run it as one container](/get-started/part2/)\n3.  [Scale your app to run multiple containers](/get-started/part3/)\n4.  [Distribute your app across a cluster](/get-started/part4/)\n5.  [Stack services by adding a backend database](/get-started/part5/)\n6.  [Deploy your app to production](/get-started/part6/)\n\n## Docker concepts\n\nDocker is a platform for developers and sysadmins to **develop, deploy, and run**\napplications with containers. The use of Linux containers to deploy applications\nis called _containerization_. Containers are not new, but their use for easily\ndeploying applications is.\n\nContainerization is increasingly popular because containers are:\n\n*   Flexible: Even the most complex applications can be containerized.\n*   Lightweight: Containers leverage and share the host kernel.\n*   Interchangeable: You can deploy updates and upgrades on-the-fly.\n*   Portable: You can build locally, deploy to the cloud, and run anywhere.\n*   Scalable: You can increase and automatically distribute container replicas.\n*   Stackable: You can stack services vertically and on-the-fly.\n\n{% asset_img '2.png' %}\n### Images and containers\n\nA container is launched by running an image. An **image** is an executable\npackage that includes everything needed to run an application–the code, a\nruntime, libraries, environment variables, and configuration files.\n\nA **container** is a runtime instance of an image–what the image becomes in\nmemory when executed (that is, an image with state, or a user process). You can\nsee a list of your running containers with the command, `docker ps`, just as you\nwould in Linux.\n\n### Containers and virtual machines\n\nA **container** runs _natively_ on Linux and shares the kernel of the host\nmachine with other containers. It runs a discrete process, taking no more memory\nthan any other executable, making it lightweight.\n\nBy contrast, a **virtual machine** (VM) runs a full-blown “guest” operating\nsystem with _virtual_ access to host resources through a hypervisor. In general,\nVMs provide an environment with more resources than most applications need.\n\n\n## Prepare your Docker environment\n\nInstall a maintained version of Docker Community Edition (CE) or Enterprise Edition (EE) on a supported platform.\n\nEnsure that you have a supported version of Docker:\n\n'''$ docker --version\nDocker version 17.12.0-ce, build c97c6d6\n\n'''\n{% asset_img '2.JPG' %}\n{% asset_img '3.JPG' %}"}